__all__ = [
        'coefficient',
]


def coefficient():
        return {
                '天香': _tx_coefficient(),
        }


def _tx_coefficient():
        return {
                '芳华一瞬': 0.8751,
                '寒林疏芳': 1.8573,
                '绝命伞': 2.1249,
                '绝命伞·破军': 3.4301,
                '香意痕一段': 1.0313,
                '香意痕': 4.6883,
                '伞舞旋': 7.0022,
                '琴心三叠': 6.1494,
                '天香意诀': 4.4195,
                '柳暗凌波': 0.5963,  # *2
                '国色天香': 0.8876,
                '伞舞盾': 2.5167,
                '重华乱舞': 20.0157,  # 6.09s
        }


def _gb_coefficient():
        return {
                'blq': 1.6979,
                'hwj': 0.9305,
                'hwj_dt': 1.7047,
                'nsqk': 4.14,
                'nsqk_l': 2.07,
                'blj': 2.4,
                'lysp': 5.2348,
                'lysp_l': 2.7,
                'psj': 2.4058,
                'psj_mj': 2.3054,  # *2
                'zft': 1.1142,
                'lxt': 0.6637,
                'dth': 0.2658,
                'szbd': 3.5863,
                'zq': 10.1802,
                'zyjh_fj': 5.8817,
                'zyjh_2': 7.3114,
                'lzbl': 20.8164,  # 6.16s
        }